import type { ReasoningData } from "@components/TestApp/types";

const names = [
  "أحمد",
  "محمد",
  "خالد",
  "عمر",
  "علي",
  "حسن",
  "يوسف",
  "إبراهيم",
  "سعيد",
  "طارق",
  "ماجد",
  "فهد",
  "سلطان",
  "ناصر",
  "بدر",
  "زياد",
  "رامي",
  "سامي",
  "كريم",
  "وليد",
  "هشام",
  "أنس",
  "باسم",
  "فادي",
  "جمال",
  "رشيد",
  "نبيل",
  "عماد",
  "غسان",
  "مازن",
];

const comparisons = [
  {
    s: [
      ["أقوى من", "ليس ضعيفًا مثل"],
      ["أضعف من", "ليس قويًا مثل"],
    ],
    q: [
      ["الأقوى", "الأقل ضعفًا"],
      ["الأضعف", "الأقل قوةً"],
    ],
  },
  {
    s: [
      ["أذكى من", "ليس غبيًا مثل"],
      ["أغبى من", "ليس ذكيًا مثل"],
    ],
    q: [
      ["الأذكى", "الأقل غباءً"],
      ["الأغبى", "الأقل ذكاءً"],
    ],
  },
  {
    s: [
      ["أطول من", "ليس قصيرًا مثل"],
      ["أقصر من", "ليس طويلًا مثل"],
    ],
    q: [
      ["الأطول", "الأقل قِصرًا"],
      ["الأقصر", "الأقل طولًا"],
    ],
  },
  {
    s: [
      ["أشجع من", "ليس جبانًا مثل"],
      ["أجبن من", "ليس شجاعًا مثل"],
    ],
    q: [
      ["الأشجع", "الأقل جبنًا"],
      ["الأجبن", "الأقل شجاعةً"],
    ],
  },
  {
    s: [
      ["ألطف من", "ليس قاسيًا مثل"],
      ["أقسى من", "ليس لطيفًا مثل"],
    ],
    q: [
      ["الألطف", "الأقل قسوةً"],
      ["الأقسى", "الأقل لطفًا"],
    ],
  },
  {
    s: [
      ["أسرع من", "ليس بطيئًا مثل"],
      ["أبطأ من", "ليس سريعًا مثل"],
    ],
    q: [
      ["الأسرع", "الأقل بطئًا"],
      ["الأبطأ", "الأقل سرعةً"],
    ],
  },
  {
    s: [
      ["أكرم من", "ليس بخيلًا مثل"],
      ["أبخل من", "ليس كريمًا مثل"],
    ],
    q: [
      ["الأكرم", "الأقل بخلًا"],
      ["الأبخل", "الأقل كرمًا"],
    ],
  },
  {
    s: [
      ["أغنى من", "ليس فقيرًا مثل"],
      ["أفقر من", "ليس غنيًا مثل"],
    ],
    q: [
      ["الأغنى", "الأقل فقرًا"],
      ["الأفقر", "الأقل غنىً"],
    ],
  },
  {
    s: [
      ["أوسم من", "ليس قبيحًا مثل"],
      ["أقبح من", "ليس وسيمًا مثل"],
    ],
    q: [
      ["الأوسم", "الأقل قبحًا"],
      ["الأقبح", "الأقل وسامةً"],
    ],
  },
  {
    s: [
      ["أهدأ من", "ليس متوترًا مثل"],
      ["أكثر توترًا من", "ليس هادئًا مثل"],
    ],
    q: [
      ["الأهدأ", "الأقل توترًا"],
      ["الأكثر توترًا", "الأقل هدوءًا"],
    ],
  },
  {
    s: [
      ["أكثر صبرًا من", "ليس عجولًا مثل"],
      ["أكثر عجلةً من", "ليس صبورًا مثل"],
    ],
    q: [
      ["الأكثر صبرًا", "الأقل عجلةً"],
      ["الأكثر عجلةً", "الأقل صبرًا"],
    ],
  },
  {
    s: [
      ["أكثر اجتهادًا من", "ليس كسولًا مثل"],
      ["أكسل من", "ليس مجتهدًا مثل"],
    ],
    q: [
      ["الأكثر اجتهادًا", "الأقل كسلًا"],
      ["الأكسل", "الأقل اجتهادًا"],
    ],
  },
  {
    s: [
      ["أصدق من", "ليس كاذبًا مثل"],
      ["أكذب من", "ليس صادقًا مثل"],
    ],
    q: [
      ["الأصدق", "الأقل كذبًا"],
      ["الأكذب", "الأقل صدقًا"],
    ],
  },
  {
    s: [
      ["أكثر تواضعًا من", "ليس متكبرًا مثل"],
      ["أكثر تكبرًا من", "ليس متواضعًا مثل"],
    ],
    q: [
      ["الأكثر تواضعًا", "الأقل تكبرًا"],
      ["الأكثر تكبرًا", "الأقل تواضعًا"],
    ],
  },
] satisfies ReasoningData["comparisons"];

export default {
  names,
  comparisons,
  question: "من هو",
} satisfies ReasoningData;
