import type { WordsMeaningData } from "@components/TestApp/types";

export default [
  ["مفتاح ربط", "مفك", "مطرقة", "كمّاشة", "مثقاب"], // أدوات للأعمال الميكانيكية
  ["جميل", "فاتن", "رائع", "بديع", "ساحر"], // صفات تصف الجمال
  ["يطبخ", "يخبز", "يشوي", "يقلي", "يحمّر"], // طرق إعداد الطعام
  ["أسد", "نمر", "فهد", "وشق", "ليث"], // حيوانات مفترسة من فصيلة السنوريات
  ["لا يمكن التنبؤ به", "متقلّب", "متذبذب", "غير ثابت", "متغيّر"], // عدم الثبات
  ["بيانو", "كمان", "تشيلو", "قيثارة", "عود"], // آلات موسيقية وترية
  ["يقود", "يوجّه", "يرشد", "يدير", "يسيّر"], // التحكم في الحركة
  ["مهجور", "قاحل", "خالٍ", "موحش", "مقفر"], // الخلو من السكان
  ["طبيب", "ممرّض", "جرّاح", "مسعف", "معالج"], // مهن طبية
  ["ساطع", "لامع", "متوهّج", "مشعّ", "برّاق"], // الضوء القوي
  ["حاسوب لوحي", "حاسوب محمول", "هاتف ذكي", "حاسوب", "قارئ إلكتروني"], // أجهزة إلكترونية
  ["ينفّذ", "يؤدّي", "ينجز", "يحقّق", "يقدّم"], // تنفيذ المهام
  ["متحمّس", "شغوف", "متّقد", "متلهّف", "متوقّد"], // المشاعر القوية
  ["مهندس معماري", "بنّاء", "مهندس", "رسّام", "مصمّم"], // مهن البناء والتصميم
  ["عاصف", "هائج", "مضطرب", "متلاطم", "غير مستقر"], // الظروف المضطربة
  ["يناقش", "يحاور", "يجادل", "يتداول", "يفاوض"], // تبادل الأفكار
  ["هادئ", "ساكن", "وادع", "مطمئن", "رزين"], // الهدوء
  ["لوحة مفاتيح", "فأرة", "شاشة", "طابعة", "ماسح ضوئي"], // ملحقات الحاسوب
  ["يزعج", "يضايق", "يقلق", "يكدّر", "يهيّج"], // التسبب في الانزعاج
  ["عبقري", "ذكي", "نابغة", "بارع", "فطن"], // الذكاء العالي
  ["دراجة هوائية", "دراجة بخارية", "لوح تزلّج", "زلّاجات", "سكوتر"], // وسائل تنقّل شخصية
  ["يصمد", "يتحمّل", "ينجو", "يثابر", "يتغلّب"], // تحمّل التحديات
  ["غامض", "مبهم", "ملغز", "محيّر", "معمّى"], // صعوبة الفهم
  ["سترة", "معطف", "كنزة", "صدرية", "عباءة"], // ملابس خارجية
  ["يصرخ", "يصيح", "يزعق", "يهتف", "يعوي"], // التعبير الصوتي العالي
  ["قديم", "عتيق", "أثري", "موغل في القدم", "تليد"], // طول التاريخ
  ["نظام", "شبكة", "إطار", "هيكل", "بنية"], // مجموعات منظّمة
  ["فاخر", "فخم", "ثري", "باذخ", "مترف"], // الرفاهية والثراء
  ["يفكّر", "يتأمّل", "يتدبّر", "يمعن", "يتروّى"], // التفكير والتدبّر
  ["سعيد", "مبتهج", "مسرور", "فرِح", "منشرح"], // السعادة
] satisfies WordsMeaningData;
